t21/Walnut_X/Packages/.cache/Keil.Kinetis_KWxx_DFP.1.4.0.pdsc
          <book name="Documents/MKW2xDxxx.pdf"   title="MKW22D512xxx5 Data Sheet"/>
          <book name="Documents/MKW2xDxxxRM.pdf" title="MKW22D512xxx5 Reference Manual"/>
        </device>

        <!-- ******************************  MKW24D512xxx5  ****************************** -->
        <device Dname="MKW24D512xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device/Include/MKW24D5.h" define="MKW24D512xxx5"/>
          <debug svd="SVD/MKW24D5.svd"/>
          <memory id="IROM1"                        start="0x00000000" size="0x00080000" default="1" startup="1"/>
          <memory id="IRAM1"                        start="0x1FFF8000" size="0x00010000" default="1" init   ="0"/>
          <algorithm name="Flash/MK_P512_50MHZ.FLM" start="0x00000000" size="0x00080000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents/MKW2xDxxx.pdf"   title="MKW24D512xxx5 Data Sheet"/>
          <book name="Documents/MKW2xDxxxRM.pdf" title="MKW24D512xxx5 Reference Manual"/>
        </device>
      </subFamily>

      <!-- ******************************  KW4x  ****************************** -->
      <subFamily DsubFamily="KW4x">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
        <book    name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf"     title="Cortex-M0+ Generic User Guide"/>
        <description>
The KW4x is an ultra low power, highly integrated single-chip device that enables Bluetooth low energy (BLE)
or IEEE Std. 802.15.4/ZigBee RF connectivity for portable, extremely low-power embedded systems.
Applications include portable health care devices, wearable sports and fitness devices, AV remote controls,
computer keyboards and mice, gaming controllers, access control, security systems, smart energy and home
area networks.
The KW4x SoC integrates a radio transceiver operating in the 2.36GHz to 2.48GHz range supporting a range of
FSK/GFSK and O-QPSK modulations, an ARM Cortex-M0+ CPU, 160KB Flash and 20KB SRAM, BLE Link Layer hardware,
802.15.4 packet processor hardware and peripherals optimized to meet the requirements of the target applications.
        </description>

        <!-- ******************************  MKW20Z160xxx4  ***************************** -->
        <device Dname="MKW20Z160xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKW20Z4.h" define="MKW20Z160xxx4"/>
          <debug svd="SVD/MKW20Z4.svd"/>
          <memory id="IROM1"                        start="0x00000000" size="0x00028000" default="1" startup="1"/>
          <memory id="IRAM1"                        start="0x1FFFF000" size="0x00005000" default="1" init   ="0"/>
          <algorithm name="Flash/MK_P160_48MHZ.FLM" start="0x00000000" size="0x00028000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents/MKW40Z160.pdf"   title="MKW40Z/30Z/20Z Data Sheet"/>
          <book name="Documents/MKW40Z160RM.pdf" title="MKW40Z/30Z/20Z Reference Manual"/>
        </device>

        <!-- ******************************  MKW21Z256xxx4  ***************************** -->
        <device Dname="MKW21Z256xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKW21Z4.h" define="MKW21Z256xxx4"/>
          <debug svd="SVD/MKW21Z4.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                              start="0x1FFF8000" size="0x00020000" default="1" init   ="0"/>
          <algorithm name="Flash/MKWxxZ_P256_2KB_SEC.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

          <!--book name="Documents/???.pdf"   title="MKW21Z160xxx4 Data Sheet"/-->
          <!--book name="Documents/???RM.pdf" title="MKW21Z160xxx4 Reference Manual"/-->
        </device>

        <!-- ******************************  MKW21Z512xxx4  ***************************** -->
        <device Dname="MKW21Z512xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKW21Z4.h" define="MKW21Z512xxx4"/>
          <debug svd="SVD/MKW21Z4.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00080000" default="1" startup="1"/>
          <memory id="IRAM1"                              start="0x1FFF8000" size="0x00020000" default="1" init   ="0"/>
          <algorithm name="Flash/MKWxxZ_P512_2KB_SEC.FLM" start="0x00000000" size="0x00080000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

          <!--book name="Documents/???.pdf"   title="MKW21Z160xxx4 Data Sheet"/-->
          <!--book name="Documents/???RM.pdf" title="MKW21Z160xxx4 Reference Manual"/-->
        </device>

        <!-- ******************************  MKW30Z160xxx4  ***************************** -->
        <device Dname="MKW30Z160xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKW30Z4.h" define="MKW30Z160xxx4"/>
          <debug svd="SVD/MKW30Z4.svd"/>
          <memory id="IROM1"                        start="0x00000000" size="0x00028000" default="1" startup="1"/>
          <memory id="IRAM1"                        start="0x1FFFF000" size="0x00005000" default="1" init   ="0"/>
          <algorithm name="Flash/MK_P160_48MHZ.FLM" start="0x00000000" size="0x00028000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents/MKW40Z160.pdf"   title="MKW40Z/30Z/20Z Data Sheet"/>
          <book name="Documents/MKW40Z160RM.pdf" title="MKW40Z/30Z/20Z Reference Manual"/>
        </device>

        <!-- ******************************  MKW31Z256xxx4  ***************************** -->
        <device Dname="MKW31Z256xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKW31Z4.h" define="MKW31Z256xxx4"/>
          <debug svd="SVD/MKW31Z4.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                              start="0x1FFF8000" size="0x00020000" default="1" init   ="0"/>
          <algorithm name="Flash/MKWxxZ_P256_2KB_SEC.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

