t21/Walnut_X/Packages/.cache/Keil.Kinetis_KWxx_DFP.1.4.0.pdsc
          <!--book name="Documents/???.pdf"   title="MKW30Z160xxx4 Data Sheet"/-->
          <!--book name="Documents/???RM.pdf" title="MKW30Z160xxx4 Reference Manual"/-->
        </device>

        <!-- ******************************  MKW31Z512xxx4  ***************************** -->
        <device Dname="MKW31Z512xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKW31Z4.h" define="MKW31Z512xxx4"/>
          <debug svd="SVD/MKW31Z4.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00080000" default="1" startup="1"/>
          <memory id="IRAM1"                              start="0x1FFF8000" size="0x00020000" default="1" init   ="0"/>
          <algorithm name="Flash/MKWxxZ_P512_2KB_SEC.FLM" start="0x00000000" size="0x00080000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

          <!--book name="Documents/???.pdf"   title="MKW30Z160xxx4 Data Sheet"/-->
          <!--book name="Documents/???RM.pdf" title="MKW30Z160xxx4 Reference Manual"/-->
        </device>

        <!-- ******************************  MKW40Z160xxx4  ***************************** -->
        <device Dname="MKW40Z160xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKW40Z4.h" define="MKW40Z160xxx4"/>
          <debug svd="SVD/MKW40Z4.svd"/>
          <memory id="IROM1"                        start="0x00000000" size="0x00028000" default="1" startup="1"/>
          <memory id="IRAM1"                        start="0x1FFFF000" size="0x00005000" default="1" init   ="0"/>
          <algorithm name="Flash/MK_P160_48MHZ.FLM" start="0x00000000" size="0x00028000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents/MKW40Z160.pdf"   title="MKW40Z/30Z/20Z Data Sheet"/>
          <book name="Documents/MKW40Z160RM.pdf" title="MKW40Z/30Z/20Z Reference Manual"/>
        </device>

        <!-- ******************************  MKW41Z256xxx4  ***************************** -->
        <device Dname="MKW41Z256xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKW41Z4.h" define="MKW41Z256xxx4"/>
          <debug svd="SVD/MKW41Z4.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                              start="0x1FFF8000" size="0x00020000" default="1" init   ="0"/>
          <algorithm name="Flash/MKWxxZ_P256_2KB_SEC.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

          <!--book name="Documents/???.pdf"   title="MKW40Z160xxx4 Data Sheet"/-->
          <!--book name="Documents/???RM.pdf" title="MKW40Z160xxx4 Reference Manual"/-->
        </device>

        <!-- ******************************  MKW41Z512xxx4  ***************************** -->
        <device Dname="MKW41Z512xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKW41Z4.h" define="MKW41Z512xxx4"/>
          <debug svd="SVD/MKW41Z4.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00080000" default="1" startup="1"/>
          <memory id="IRAM1"                              start="0x1FFF8000" size="0x00020000" default="1" init   ="0"/>
          <algorithm name="Flash/MKWxxZ_P512_2KB_SEC.FLM" start="0x00000000" size="0x00080000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

          <!--book name="Documents/???.pdf"   title="MKW40Z160xxx4 Data Sheet"/-->
          <!--book name="Documents/???RM.pdf" title="MKW40Z160xxx4 Reference Manual"/-->
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="MKW01Z4 CMSIS">
      <description>Freescale Kinetis KW01 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKW01Z128xxx4"/>
    </condition>

    <condition id="MKW21D5 CMSIS">
      <description>Freescale Kinetis KW21 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKW21D256xxx5"/>
      <accept Dname="MKW21D512xxx5"/>
    </condition>

    <condition id="MKW22D5 CMSIS">
      <description>Freescale Kinetis KW22 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKW22D512xxx5"/>
    </condition>

    <condition id="MKW24D5 CMSIS">
      <description>Freescale Kinetis KW24 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKW24D512xxx5"/>
    </condition>

    <condition id="MKW20Z4 CMSIS">
      <description>Freescale Kinetis KW20 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKW20Z160xxx4"/>
    </condition>

    <condition id="MKW30Z4 CMSIS">
      <description>Freescale Kinetis KW30 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKW30Z160xxx4"/>
    </condition>

    <condition id="MKW40Z4 CMSIS">
      <description>Freescale Kinetis KW40 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKW40Z160xxx4"/>
    </condition>

