t21/Walnut_X/Packages/.cache/Keil.Kinetis_KWxx_DFP.1.4.0.pdsc
    <condition id="MKW21Z4 CMSIS">
      <description>Freescale Kinetis KW21 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKW21Z256xxx4"/>
      <accept Dname="MKW21Z512xxx4"/>
    </condition>

    <condition id="MKW31Z4 CMSIS">
      <description>Freescale Kinetis KW31 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKW31Z256xxx4"/>
      <accept Dname="MKW31Z512xxx4"/>
    </condition>

    <condition id="MKW41Z4 CMSIS">
      <description>Freescale Kinetis KW41 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKW41Z256xxx4"/>
      <accept Dname="MKW41Z512xxx4"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup MKW01Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW01Z4 CMSIS">
      <description>System Startup for Kinetis KW01 48MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device/Include/MKW01Z4.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_MKW01Z4.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKW01Z4.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW21D5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW21D5 CMSIS">
      <description>System Startup for Kinetis KW01 48MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device/Include/MKW21D5.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_MKW21D5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKW21D5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW22D5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW22D5 CMSIS">
      <description>System Startup for Kinetis KW01 48MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device/Include/MKW22D5.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_MKW22D5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKW22D5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW24D5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW24D5 CMSIS">
      <description>System Startup for Kinetis KW01 48MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device/Include/MKW24D5.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_MKW24D5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKW24D5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW20Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW20Z4 CMSIS">
      <description>System Startup for Kinetis KW20 48MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device/Include/MKW20Z4.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_MKW20Z4.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKW20Z4.c"       attr="config" version="1.0.0"/>
        <file category="header" name="Device/Source/system_MKW20Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW30Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW30Z4 CMSIS">
      <description>System Startup for Kinetis KW30 48MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device/Include/MKW30Z4.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_MKW30Z4.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKW30Z4.c"       attr="config" version="1.0.0"/>
        <file category="header" name="Device/Source/system_MKW30Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW40Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW40Z4 CMSIS">
      <description>System Startup for Kinetis KW4x 48MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device/Include/MKW40Z4.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_MKW40Z4.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKW40Z4.c"       attr="config" version="1.0.0"/>
        <file category="header" name="Device/Source/system_MKW40Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW21Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW21Z4 CMSIS">
      <description>System Startup for Kinetis KW21 48MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device/Include/MKW21Z4.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_MKW21Z4.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKW21Z4.c"       attr="config" version="1.0.0"/>
        <file category="header" name="Device/Source/system_MKW21Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW31Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW31Z4 CMSIS">
      <description>System Startup for Kinetis KW31 48MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device/Include/MKW31Z4.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_MKW31Z4.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKW31Z4.c"       attr="config" version="1.0.0"/>
        <file category="header" name="Device/Source/system_MKW31Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW41Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW41Z4 CMSIS">
      <description>System Startup for Kinetis KW41 48MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device/Include/MKW41Z4.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_MKW41Z4.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKW41Z4.c"       attr="config" version="1.0.0"/>
        <file category="header" name="Device/Source/system_MKW41Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

